Documents/ПоступлениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоступлениеТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МестонахождениеОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьПредъявленСчетФактура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособОтраженияРасходовПоАмортизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьУчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаОС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕстьРасхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьНомерВходящегоСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьКодСпособаПолучения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьНДСПредъявленКВычету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетНаОплатуПоставщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьКодВидаОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьДатаВходящегоСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭтоУниверсальныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>itnСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>itnКоличествоНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>itnСчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>itnПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>itnСтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>itnНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратнаяТара</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ОтражениеВУСН</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ОтражениеВУСН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Оборудование</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсновныеСредства</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АгентскиеУслуги</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбъектыСтроительства</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>itnДома</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дом</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеТоваровУслуг/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// РАСШИРЕНИЕ ФОРМЫ ДОКУМЕНТА ПОСТУПЛЕНИЕТОВАРОВУСЛУГ
// МОДУЛЬ ФОРМЫ

&НаКлиенте
Перем Расш_РежимДокумента;

&Перед("ПриСозданииНаСервере")
Процедура Расш_ПередПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЭтаФорма.ИмеетРеквизит("Расш_РежимДокумента") Тогда
		
		МассивРеквизитов = Новый Массив;
		ТипСтрока = Новый ОписаниеТипов("Строка");
		МассивРеквизитов.Добавить(Новый РеквизитФормы("Расш_РежимДокумента", ТипСтрока, , "Режим документа"));
		
		ЭтаФорма.ИзменитьСоставРеквизитов(МассивРеквизитов);
		
	КонецЕсли;
	
КонецПроцедуры

&После("ПриСозданииНаСервере")
Процедура Расш_ПослеПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Расш_СоздатьЭлементыФормы();
	Расш_РежимДокумента = "Товары";
	Расш_ОбновитьВидимостьПоРежимуНаСервере(Расш_РежимДокумента);
	
КонецПроцедуры

&НаСервере
Процедура Расш_СоздатьЭлементыФормы()
	
	КомПанель = ЭтаФорма.Элементы.Найти("ФормаКоманднаяПанель");
	Если КомПанель = Неопределено Тогда
		КомПанель = ЭтаФорма.Элементы.Найти("ДокументКоманднаяПанель");
	КонецЕсли;
	Если КомПанель = Неопределено Тогда
		КомПанель = ЭтаФорма.Элементы.Найти("ОсновнаяГруппа");
	КонецЕсли;
	
	Если КомПанель <> Неопределено Тогда
		
		Если ЭтаФорма.Элементы.Найти("Расш_ГруппаУправления") = Неопределено Тогда
			
			НоваяГруппа = ЭтаФорма.Элементы.Вставить("Расш_ГруппаУправления", 
				Тип("ГруппаФормы"), КомПанель);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.Заголовок = "Управление расчетами";
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			
			Переключатель = ЭтаФорма.Элементы.Вставить("Расш_РежимДокумента", 
				Тип("ПолеФормы"), НоваяГруппа);
			Переключатель.Вид = ВидПоляФормы.ПолеПереключателя;
			Переключатель.ПутьКДанным = "Расш_РежимДокумента";
			Переключатель.Заголовок = "Режим документа:";
			
			СписокВариантов = Новый СписокЗначений;
			СписокВариантов.Добавить("Товары", "Товары");
			СписокВариантов.Добавить("Услуги", "Услуги");
			Переключатель.СписокВыбора = СписокВариантов;
			
			Кнопка = ЭтаФорма.Элементы.Вставить("Расш_ЗаполнитьПоДомам", 
				Тип("КнопкаФормы"), НоваяГруппа);
			Кнопка.Заголовок = "Заполнить по домам";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш_РежимДокументаПриИзменении(Элемент)
	
	Расш_ОбновитьВидимостьПоРежимуНаСервере(Расш_РежимДокумента);
	
КонецПроцедуры

&НаСервере
Процедура Расш_ОбновитьВидимостьПоРежимуНаСервере(Режим)
	
	СкладЭлемент = ЭтаФорма.Элементы.Найти("Склад");
	Если СкладЭлемент <> Неопределено Тогда
		СкладЭлемент.Видимость = (Режим = "Товары");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш_ЗаполнитьПоДомам(Команда)
	
	Если Расш_РежимДокумента <> "Услуги" Тогда
		ПоказатьПредупреждение(, "Распределение по домам доступно только в режиме ""Услуги""");
		Возврат;
	КонецЕсли;
	
	// Исправлено: используем ЭтаФорма.Объект
	Если ЭтаФорма.Объект.СуммаДокумента = 0 Тогда
		ПоказатьПредупреждение(, "itnСумма документа равна нулю. Заполнение невозможно.");
		Возврат;
	КонецЕсли;
	
	ОчиститьТЧ = Вопрос("Очистить текущий список услуг перед заполнением?", 
		РежимДиалогаВопрос.ДаНет, 0);
	
	Расш_ЗаполнитьПоДомамНаСервере(ОчиститьТЧ = КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаСервере
Процедура Расш_ЗаполнитьПоДомамНаСервере(ОчищатьТЧ)
	
	Если ОчищатьТЧ Тогда
		ЭтаФорма.Объект.Товары.Очистить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Расш_СвойстваНоменклатурныхГрупп.НоменклатурнаяГруппа КАК Дом,
	|	Расш_СвойстваНоменклатурныхГрупп.Площадь КАК Площадь
	|ИЗ
	|	РегистрСведений.Расш_СвойстваНоменклатурныхГрупп КАК Расш_СвойстваНоменклатурныхГрупп
	|ГДЕ
	|	Расш_СвойстваНоменклатурныхГрупп.Используется = ИСТИНА
	|	И Расш_СвойстваНоменклатурныхГрупп.Площадь > 0";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 Тогда
		Сообщить("Нет домов, отмеченных для использования, с заполненной площадью");
		Возврат;
	КонецЕсли;
	
	ОбщаяПлощадь = 0;
	Для каждого Строка Из Результат Цикл
		ОбщаяПлощадь = ОбщаяПлощадь + Строка.Площадь;
	КонецЦикла;
	
	СуммаДокумента = ЭтаФорма.Объект.СуммаДокумента;
	СуммаНакоплено = 0;
	
	Для Индекс = 0 По Результат.Количество() - 1 Цикл
		
		Строка = Результат[Индекс];
		
		Если Индекс = Результат.Количество() - 1 Тогда
			СуммаСтроки = СуммаДокумента - СуммаНакоплено;
		Иначе
			СуммаСтроки = Окр(СуммаДокумента * Строка.Площадь / ОбщаяПлощадь, 2);
			СуммаНакоплено = СуммаНакоплено + СуммаСтроки;
		КонецЕсли;
		
		НоваяСтрока = ЭтаФорма.Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Строка.Дом;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Цена = СуммаСтроки;
		НоваяСтрока.itnСумма = СуммаСтроки;
		
		Попытка
			НоваяСтрока.СтавкаНДС = ЭтаФорма.Объект.СтавкаНДС;
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	ЭтаФорма.Объект.Модифицированность = Истина;
	
	Сообщить("Выполнено распределение суммы " + Строка(СуммаДокумента) + 
		" по " + Строка(Результат.Количество()) + " домам");
	
КонецПроцедуры
